% Από την συνάρτηση μετάφορας πάμε στον χώρο
% κατάστασης μέσω της εντολής tf2ss(αριθμητής,παρανομαστής)
b = 32;
a = [1 2 10 0];
[A,B,C,D] = tf2ss(b,a);

% Πρέπει να τροποποιήσουμε κατάλληλα τους πίνακες Α και Β
% Οι πίνακες τροποποιούνται κατάλληλα αφού είδαμε τους πίνακες
% που υπολογίσαμε πριν και προσθέσαμε τα μηδενικά.
Aa = [2 -10  0 0; 1 0 0 0;0 1 0 0;0 0 -32 0];
Ba= [1;0;0;0];

% Για υπερύψωση<10sec και Ts<1sec 
% καταλήγουμε στους πόλους -7 +-j7.14
p1 = -7 + 7.14j;
p2 = -7 - 7.14j;

% Τον 3ο πόλο θα τον τοποθετήσουμε αρκετά
% αριστερά συγκριτικά με του άλλους 2 πόλους
% για να μην υπηρεάζει το σύστημα
p3 = -20;

% Τώρα ο πίνακας Α είναι 4Χ4,άρα τοποτετούμε
% τον 4ο πόλο αρκετά πιο αριστερά για να μην
% υπηρέαζει
p4 = -40;
K = place(Aa,Ba,[p1 p2 p3 p4]);
Kz = K(4);
K = K(1:3);

% Για να είναι ο παρατηρητής πιο γρήγορος από
% τον ελεγκτή θα βάλουμε τους πόλους του 5 φορές
% πιο αριστερά από τους πόλους του ελεγκτή
% Βρίσκουμε τα κέρδη του παρατηρητή
L = acker(A',C',5*[p1 p2 p3 ])';